var myText = [{
    total:"<h2>Введение</h2>"
+"<h3>Введение в JavaScript</h3>"
    +"<p>1.Введение в JavaScript дает нам общее понятие о создании, общей истории и развити JavaScript</p>"
    +"<h3>Справочники и спецификации</h3>"
    +"<p>2.Подраздел справочники и спецификации дает нам информацию о том, какие особенности у каких браузеров и где можно найти корректную документацию касаемо JavaScript</p>"
    +"<h3>Редакторы для кода</h3>"
    +"<p>3.В пункте Редакторы для кода нам представляется возможность ознакомиться с редакторами кода и ссылками на оф. страницы для скачивания.</p>"
    +"<h3>Консоль разработчика</h3>"
    +"<p>4.Пункт Консоль разработчика в кратце рассказывает нам на что стоит обратить внимание при проверке кода через консоль.</p>"
} , {
    total:"<h2>Основы JavaScript</h2>"
    +"<h3> Привет, мир!</h3>"
    +"<p>В данной статье нас знакомяс с особенностями месторасположения тега script и корректным размещением коментариев и тд.</p>"
    +"<h3>Внешние скрипты, порядок исполнения</h3>"
    +"<p>Данная статья обучает нас подключению внешних скриптов и корректирует нас в их особенностях и различиях при загрузке на страницу а так же рассказывает, как они непосредственно влияют на саму загрузку страницы</p>"
    +"<h3>Структура кода</h3>"
    +"<p>Данная статья обучит нас как корректнее делать разметку кода, переносы и разбитие на строки</p>"
    +"<h3>Современный стандарт, use strict </h3>"
    +"<p>Use strict строка- дает нам возможность писать более современный код, но в то же время имеет свои особенности в использовании...</p>"
    +"<h3>Переменные</h3>"
    +"<p>На мой взгляд-одна из важнейших статей в данном разделе! Благодаря ей мы более детально поймем как работать с переменными, заполнять их информацией и использовать ее в будущем.</p>"
    +"<h3>Правильный выбор имени переменной</h3>"
    +"<p>Правильный выбор имени переменных-одно из основных  базовых  пониманий того, что в ней будет храниться либо для чего она может быть использована</p>"
    +"<h3>Шесть типов данных, typeof</h3>"
    +"<p>В данной статье нас в кратце ознакамливают с 5 основными примитивными  типами данных и обьектами</p>"
    +"<h3>Операторы</h3>"
    +"<p>Исходя из школьных программ все мы помним про математические елементы вычисления. Но в данной статье афтор открывает нам их новые возможности и раскрывает секреты использования в програмировании</p>"
    +"<h3>Условные операторы: if, '?'</h3>"
    +"<p>Данная статья обучает нас различиям методов использования операторов а так же дает нам возможность понять, как грамотно выстроить логическую цепочку действий при различных ответах(либо без них).</p>"
    +"<h3>Функции</h3>"
    +"<p>Данный ряд статей нам рассказывает о том, как грамотно создавать и использовать функции и с их помощью делать клиентскую сторону более динамичной.</p>"
} , {
    total:"<h2>Качество кода</h2>"
    +"<h3>Отладка в chrome</h3>"
    +"<p>В данном пункте нам рассказывается о корректном тестировании кода, его шифровании и отладке в браузере. О том, куда стоит обратить внимание при работе с данным браузером.</p>"
    +"<h3>Советы по стилю кода</h3>"
    +"<p>Мы переходим к стилю кода и его корректному написанию. В этом разделе нам предоставят таблицу со всеми нареканиями и замечаниями которые могут навредить нашему написанию кода и его формированию(дальнейшему использованию) на странице</p>"
    +"<h3>Как писать неподдерживаемый код?</h3>"
    +"<p>Для написания неподдерживаемого кода нужно усложнить его понятность для окружающих(уловки на эту тему указаны в данном разделе) а так же нам дается краткая екскурсия того, как этот код писать так, чтоб он был понятен только вам</p>"
    +"<h3>Автоматические тесты при помощи chai и mocha</h3>"
    +"<p>С данной главой я рекомендовал бы ознакомиться в начале своей деятельности как програмиста. Ведь писочницу можно использовать как тесты (которые гарантируют правильность кода),документацию по функциям и описанию их конкретных задач</p>"
}, {
    total:"<h2>Структуры данных</h2>"
    +"<p>В данной главе автор знакомит нас юолее подробно с типами данных и рассказывает нам о том, как более широко можно использовать и преобразовывать их.</p>"
}  , {
    total:"<h2>Замыкания</h2>"
    +"<p>Данная глава открывает нам новые возможности функций (в частности замыкания), и рассказывает, как можно использовать разные функии внутри функций а так же как повысить их функциональность и как управлять памятью</p>"
}  ,  {
    total:"<h2>Методы объектов</h2>"
    +"<p>В данном разделе мы узнаем о новом виде функций-конструкторах. Нам пишут о том, как отличить их в обычном коде(написание с большой буквы). Также мы узнаем о различных методах(статических/фабричных) с кратким описанием их функционала и мер использования.</p>"
}  ,  {
    total:"<h2>другие возможности</h2>"
    +"<p>Этот раздел знакомит нас с такими функциями как setTimeout и setInterval которые позволяют управлять нам временем выведения результатов и не только. Так же ассказывается о преобразователях в строку и обратно на основе json</p>"
}  ,  {
    total:"<h2>ООП в функциональном стиле</h2>"
    +"<p>Данные статьи дают нам краткое понятие о таких функциях как гетер и сетер. Которые выполняют такие действия как - геттер возвращает значение, сеттер – устанавливает</p>"
}  ,  {
    total: "<h2>ООП в прототипном стиле</h2>"
    +"<p></p>"
}  ,  {
    total:"<h2>Современные возможности ES-2015</h2>"
    +"<p>Современные возможности ES-2015</p>"
}];

//myCode
var li = document.querySelectorAll("li");
var div = document.querySelector("contentBar");




for (var i = 0; i < li.length; i++) {
    (function(a,iterator) {
        a.onclick = function() {
            for (var outclass = 0; outclass < li.length; outclass++) {
//                div[outclass].classList.remove("active");
//                div[iterator].innerHTML -= myText[iterator].total;
            }

//            div[iterator].innerHTML += myText[iterator].total;
//            div[iterator].classList.add("active");
            var divs = document.createElement("div");
            divs.calssName = "characteristics";
            divs.innerHTML += myText[iterator].total;
            console.dir(li.appendChild("divs"));

        }
    }(li[i], i));
};

